"use client";

import { useEffect } from "react";

export default function ConsoleSignature() {
  useEffect(() => {
    console.log(
      `
%c
███████╗███╗   ██╗██████╗ ██╗ ██████╗ ██╗   ██╗███████╗
██╔════╝████╗  ██║██╔══██╗██║██╔═══██╗██║   ██║██╔════╝
█████╗  ██╔██╗ ██║██████╔╝██║██║   ██║██║   ██║█████╗  
██╔══╝  ██║╚██╗██║██╔══██╗██║██║▄▄ ██║██║   ██║██╔══╝  
███████╗██║ ╚████║██║  ██║██║╚██████╔╝╚██████╔╝███████╗
╚══════╝╚═╝  ╚═══╝╚═╝  ╚═╝╚═╝ ╚══▀▀═╝  ╚═════╝ ╚══════╝

Enrique Calvo Garcia was here! 
👉 https://github.com/KingCalvo/portafolio

Built with ❤️ by Enrique Calvo Garcia
`,
      "color:#3b82f6;",
    );
  }, []);

  return null;
}
